print("Понеділок - pn\nВівторок - vt\nСереда - sr\nЧетвер - cht\nП'ятниця - pt\nСубота - sb\nНеділя - nd")
dt = input("Виберіть день тидня де потрібно знайти вікно: ")
gr1 = f"g{input('Виберіть номер першої групи: ')}"
gr2 = f"g{input('Виберіть номер другої групи: ')}"


l = {
    "entrys": [{
        "day": ["pn", "cht", "nd"],
        "g1": [1, 0, 2, 1, 0, 2],
        "g2": [0, 2, 1, 0, 2, 1],
        "g3": [2, 1, 0, 2, 1, 0]
    },
        {
        "day": ["vt", "pt"],
        "g1": [0, 2, 1, 0, 2, 1],  
        "g2": [2, 1, 0, 2, 1, 0],
        "g3": [1, 0, 2, 1, 0, 2]
    },
        {
        "day": ["sr", "sb"],
        "g1": [2, 1, 0, 2, 1, 0],  
        "g2": [1, 0, 2, 1, 0, 2],
        "g3": [0, 2, 1, 0, 2, 1]
    },
    ]
}
# 0 - Світло є
# 1 - Світла нема
# 2 - 50 на 50


for entry in l["entrys"]:
    if dt in entry["day"]:
        day = entry

viddilne_mistse = [
    "1:00-5:00",
    "5:00-9:00",
    "9:00-13:00",
    "13:00-17:00",
    "17:00-21:00",
    "21:00-1:00"
]

for i in range(6):
    if day[gr1][i] != 1 and day[gr2][i] != 1:
        print(f"Групи можуть зустрітись в {viddilne_mistse[i]}")
        if day[gr1][i] == 2:
            print(f"Зверніть увагу! У користувачів {gr1} світла може не бути")
        if day[gr2][i] == 2:
            print(f"Зверніть увагу! У користувачів {gr2} світла може не бути")
